In [29]:
connection = sqlite3.connect('commontest.db')

In [30]:
connection

In [31]:
cursor = connection.cursor()

In [32]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees(
id integer primary key,
name text,
age integer,
department text
)''')

In [33]:
cursor.execute('''
Insert Into employees(name,age,department)
                values("Krish",32,"data scientist")

''')
cursor.execute('''
Insert Into employees(name,age,department)
                values("nish",32,"data scientist")

''')
cursor.execute('''
Insert Into employees(name,age,department)
                values("bob",32,"data scientist")

''')
cursor.execute('''
Insert Into employees(name,age,department)
                values("knbob",32,"data engineer")

''')
cursor.execute('''
Insert Into employees(name,age,department)
                values("bouob",32,"ai scientist")

''')
cursor.execute('''
Insert Into employees(name,age,department)
                values("boob",32,"ml scientist")

''')
connection.commit()

In [34]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Krish', 32, 'data scientist')
(2, 'nish', 32, 'data scientist')
(3, 'bob', 32, 'data scientist')
(4, 'knbob', 32, 'data engineer')
(5, 'bouob', 32, 'ai scientist')
(6, 'boob', 32, 'ml scientist')

In [ ]:
cursor.execute('Select * from employees where department="data scientist"')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Krish', 32, 'data scientist')
(2, 'nish', 32, 'data scientist')
(3, 'bob', 32, 'data scientist')

In [41]:
cursor.execute('''
UPDATE employees 
SET age = 33 
WHERE department="data scientist"
''')
connection.commit()
cursor.execute('Select * from employees where department="data scientist"')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Krish', 33, 'data scientist')
(2, 'nish', 33, 'data scientist')
(3, 'bob', 33, 'data scientist')

In [43]:
cursor.execute('''
DELETE FROM employees 

WHERE department="data engineer"
''')
connection.commit()
cursor.execute('Select * from employees ')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Krish', 33, 'data scientist')
(2, 'nish', 33, 'data scientist')
(3, 'bob', 33, 'data scientist')
(5, 'bouob', 32, 'ai scientist')
(6, 'boob', 32, 'ml scientist')